# Pandas Week 5

# 17. Resampling pada  time series data

In [1]:
#import modules
import pandas as pd
import numpy as np 

#check Version
print(pd.__version__)
print(pd.__version__)

1.1.3
1.1.3

In [4]:
#Data Frame Prep
n_rows=365 *24
n_cols=2
cols=['col1','col2']

df=pd.DataFrame(np.random.randint(1,20,size=(n_rows, n_cols)),
               columns=cols)

df.index=pd.util.testing.makeDateIndex(n_rows, freq='H')
df

                     col1  col2
2000-01-01 00:00:00    11    10
2000-01-01 01:00:00     8     1
2000-01-01 02:00:00    15    14
2000-01-01 03:00:00    15    15
2000-01-01 04:00:00     4     9
...                   ...   ...
2000-12-30 19:00:00     5    11
2000-12-30 20:00:00     3     2
2000-12-30 21:00:00    18    14
2000-12-30 22:00:00     5    14
2000-12-30 23:00:00     5    11

[8760 rows x 2 columns]

# Resampling data dengan interval monthly atau Bulan

In [6]:
df.resample('M')['col1'].sum().to_frame()
#data yang kita akses sudah tidak bisa per individual data tetapi yang bisa kita akses adalah data agregasi

            col1
2000-01-31  7425
2000-02-29  6930
2000-03-31  7465
2000-04-30  7339
2000-05-31  7445
2000-06-30  7010
2000-07-31  7649
2000-08-31  7447
2000-09-30  7195
2000-10-31  7312
2000-11-30  7252
2000-12-31  7207

# Resampling data dengan interval Daily atau hari

In [9]:
df.resample('D')['col1'].sum().to_frame()

            col1
2000-01-01   261
2000-01-02   285
2000-01-03   207
2000-01-04   243
2000-01-05   250
...          ...
2000-12-26   214
2000-12-27   256
2000-12-28   186
2000-12-29   202
2000-12-30   233

[365 rows x 1 columns]

# 18. Membentuk dummy Data Frame

In [10]:
#import modules
import pandas as pd
import numpy as np 

#check Version
print(pd.__version__)
print(pd.__version__)

1.1.3
1.1.3

# Membentuk Data Frame dari Dictionary

In [13]:
pd.DataFrame({'col1':[1,2,3,4],
             'col2':[5,6,7,8]})

   col1  col2
0     1     5
1     2     6
2     3     7
3     4     8

# Membentuk Data Frame dari Numpy Array

In [14]:
n_rows=5
n_cols=2

arr=np.random.randint(1,20,size=(n_rows, n_cols))
arr

array([[ 7, 14],
       [19,  3],
       [ 5, 12],
       [ 1,  8],
       [15, 18]])

In [16]:
pd.DataFrame(arr,columns=tuple('AB'))

    A   B
0   7  14
1  19   3
2   5  12
3   1   8
4  15  18

# Membentuk Data Frame dengan memanfaatkan pandas.util.testing

In [17]:
pd.util.testing.makeDataFrame().head()
#Membuat sebuah Dummy Data Frame sederhana

                   A         B         C         D
cwNOtKunia  1.242595  0.657152 -0.913856 -0.885913
UQcfXFoVIa  1.340902 -0.487666  0.823083 -0.363256
tkj2OSBV5x  0.214393  0.794964  0.359394  0.062031
NBSv42qoXd -1.871698 -1.580772 -0.057140 -0.223642
MXk9VkqlMP -3.015480  0.484488 -0.195957 -0.442721

In [18]:
pd.util.testing.makeMixedDataFrame().head()
#Membuat sebuah Dummy Data Frame dengan tipe data campuran

     A    B     C          D
0  0.0  0.0  foo1 2009-01-01
1  1.0  1.0  foo2 2009-01-02
2  2.0  0.0  foo3 2009-01-05
3  3.0  1.0  foo4 2009-01-06
4  4.0  0.0  foo5 2009-01-07

In [19]:
pd.util.testing.makeTimeDataFrame().head()
#Membentuk DataFrame yang berisi tipe data waktu

                   A         B         C         D
2000-01-03 -0.152359 -0.368807  0.267544 -1.435628
2000-01-04 -0.435073  1.345318  0.912286 -0.426983
2000-01-05  0.851333  0.484376  1.849454 -0.267558
2000-01-06 -1.238784 -1.661026  1.842490  0.430548
2000-01-07 -0.287869 -0.074090  0.454337  0.228416

In [22]:
pd.util.testing.makeMissingDataframe().head()
#Membentuk DataFrame dummy yang memiliki beberapa missing value atu NaN yang ditempatkan secara acak

                   A         B         C         D
K7gWrYFNzj -2.359893 -2.076845 -0.298077 -0.385404
XlB3OFazpi  0.468995 -2.997602 -0.352891       NaN
LNEmLOfiSz       NaN -0.163106       NaN -0.432600
RIVxTbVPmG  1.266110       NaN  1.040971 -0.910362
y8Va5mdfIg  1.148618  0.638519 -0.467482       NaN

# 19. Formatting tampilan Data Frame

In [1]:
#import modules
import pandas as pd
import numpy as np 

#check Version
print(pd.__version__)
print(pd.__version__)

1.1.3
1.1.3

Data Frame Prep

In [2]:
n_rows=5
n_cols=2
cols=['omset','operasional']

df=pd.DataFrame(np.random.randint(1,20,size=(n_rows, n_cols)),
               columns=cols)


df

   omset  operasional
0     11           13
1      2            4
2     14            6
3      9           16
4     17           17

In [3]:
df['omset']=df['omset']*100_000
df['operasional']=df['operasional']*10_000
df

     omset  operasional
0  1100000       130000
1   200000        40000
2  1400000        60000
3   900000       160000
4  1700000       170000

In [4]:
df.index = pd.util.testing.makeDateIndex(n_rows,freq='D')
df = df.reset_index()
df = df.rename(columns={'index':'tanggal'})
df

C:\Users\Markvinson\anaconda3\lib\site-packages\pandas\util\__init__.py:12: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing

     tanggal    omset  operasional
0 2000-01-01  1100000       130000
1 2000-01-02   200000        40000
2 2000-01-03  1400000        60000
3 2000-01-04   900000       160000
4 2000-01-05  1700000       170000

# Melakukan Formatting Tampilan Data Frame

In [5]:
formatku = {'tanggal':'{:%d/%m/%y}',
           'operasional':'Rp {:.2f}',
           'omset':'Rp {:.2f}'}
laporan = df.style.format(formatku)
laporan

In [6]:
type(laporan)

pandas.io.formats.style.Styler

In [7]:
laporan.hide_index()

In [8]:
laporan.set_caption('Data Omset dan Operasional')

In [9]:
laporan.highlight_min('omset',color='pink')
laporan.highlight_max('omset',color='lightgreen')

laporan.highlight_min('operasional',color='lightblue')
laporan.highlight_min('operasional',color='grey')

# 20. Menggabungkan dua Data Frame secara berdampingan

In [10]:
#import modules
import pandas as pd
import numpy as np 

#check Version
print(pd.__version__)
print(pd.__version__)

1.1.3
1.1.3

Data Frame Prep

d1={'col1':[1,2,3],
   'col2':[10,20,30]}
df1=pd.DataFrame(d1)
df1

In [12]:
d2={'col3':[15,25,35],
   'col4':[40,45,60]}
df2=pd.DataFrame(d2)
df2

   col3  col4
0    15    40
1    25    45
2    35    60

# Menggabungkan (merge) dua Data Frame secara berdampingan

In [23]:
df=pd.merge(df1,df2,left_index=True, right_index=True)
df

   col1  col2  col3  col4
0     1    10    15    40
1     2    20    25    45
2     3    30    35    60

source: https://www.youtube.com/playlist?list=PL2O3HdJI4voGdD_9xhVCTBoDTDNHpajm5